; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v10 ?v7)
             (pred_5 ?v12 ?v3)
             (pred_2 ?v10 ?v3)
             (pred_8 ?v2 ?v10 )
	     (pred_3 ?v10)
             (pred_10 ?v4)
             (pred_7 ?v12)
             (pred_9 ?v3)
             (pred_12 ?v10)
             (pred_6 ?v12)
             (pred_4 ?v10)
             (pred_1 ))



(:action op_3
:parameters (?v8 ?v1 ?v6 ?v9)
:precondition (and (pred_10 ?v8) (pred_10 ?v1) (pred_7 ?v6) (pred_9 ?v9)
          (pred_11 ?v8 ?v1) (pred_5 ?v6 ?v9)
                   (pred_2 ?v1 ?v9) (pred_3 ?v8) 
                   (pred_12 ?v1) (pred_6 ?v6))
:effect (and  (pred_4 ?v1) (not (pred_12 ?v1))))


(:action op_4
:parameters (?v8 ?v11)
:precondition (and (pred_10 ?v8) (pred_10 ?v11)
               (pred_3 ?v8) (pred_11 ?v8 ?v11) (pred_4 ?v11))
:effect (and (pred_3 ?v11) (not (pred_3 ?v8))))

(:action op_5
:parameters (?v8 ?v6)
:precondition (and (pred_10 ?v8) (pred_7 ?v6) 
                  (pred_3 ?v8) (pred_8 ?v6 ?v8) (pred_1 ))
:effect (and (pred_6 ?v6)
   (not (pred_8 ?v6 ?v8)) (not (pred_1 ))))


(:action op_2
:parameters (?v8 ?v13 ?v5)
:precondition (and (pred_10 ?v8) (pred_7 ?v13) (pred_7 ?v5)
                  (pred_3 ?v8) (pred_6 ?v5) (pred_8 ?v13 ?v8))
:effect (and (pred_6 ?v13) (pred_8 ?v5 ?v8)
        (not (pred_6 ?v5)) (not (pred_8 ?v13 ?v8))))

(:action op_1
:parameters (?v8 ?v6)
:precondition (and (pred_10 ?v8) (pred_7 ?v6) 
                  (pred_3 ?v8) (pred_6 ?v6))
:effect (and (pred_1 ) (pred_8 ?v6 ?v8) (not (pred_6 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_04 obj_15 obj_19 obj_16 obj_14 obj_05 obj_21 obj_18 obj_09 obj_10 obj_17 obj_06 obj_03 obj_20 obj_02
    obj_11 obj_13
    obj_12 obj_01 obj_07
    )

    (:init
       (pred_1)

       (pred_10 obj_08)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_01)
       (pred_7 obj_07)

       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_04 obj_14)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_19 obj_21)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_04)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_21 obj_17)
       (pred_11 obj_21 obj_19)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_10 obj_20)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_10)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_02 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_05)
       (pred_12 obj_09)
       (pred_2  obj_19 obj_11)
       (pred_2  obj_05 obj_13)
       (pred_2  obj_09 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_21)
       (pred_4 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_06)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_02)

       (pred_5  obj_12 obj_11)
       (pred_5  obj_01 obj_13)
       (pred_5  obj_07 obj_13)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_07 obj_16)
       (pred_3 obj_08)
    )

    (:goal (and
       (pred_8 obj_01 obj_06)
       (pred_8 obj_07 obj_18)
    ))
(:constraints
  (always (not (pred_3 obj_09)))
)
)

; plan
1. (op_4 obj_08 obj_16)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_16)
   goals met: 0 of 2
2. (op_5 obj_16 obj_07)
   deleted: (pred_8 obj_07 obj_16) (pred_1)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_4 obj_16 obj_18)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_18)
   goals met: 0 of 2
4. (op_3 obj_18 obj_09 obj_07 obj_13)
   deleted: (pred_12 obj_09)
   added: (pred_4 obj_09)
   goals met: 0 of 2
5. (op_1 obj_18 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_1) (pred_8 obj_07 obj_18)
   goals met: 1 of 2
6. (op_4 obj_18 obj_06)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_06)
   goals met: 1 of 2
7. (op_4 obj_06 obj_03)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_03)
   goals met: 1 of 2
8. (op_4 obj_03 obj_20)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_20)
   goals met: 1 of 2
9. (op_4 obj_20 obj_10)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_10)
   goals met: 1 of 2
10. (op_4 obj_10 obj_17)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_17)
   goals met: 1 of 2
11. (op_5 obj_17 obj_01)
   deleted: (pred_8 obj_01 obj_17) (pred_1)
   added: (pred_6 obj_01)
   goals met: 1 of 2
12. (op_4 obj_17 obj_10)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_10)
   goals met: 1 of 2
13. (op_4 obj_10 obj_20)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_20)
   goals met: 1 of 2
14. (op_4 obj_20 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_03)
   goals met: 1 of 2
15. (op_4 obj_03 obj_06)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_06)
   goals met: 1 of 2
16. (op_1 obj_06 obj_01)
   deleted: (pred_6 obj_01)
   added: (pred_1) (pred_8 obj_01 obj_06)
   goals met: 2 of 2
